# Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен
# лихвен процент. Използвайте следната формула:
# сума = депозирана сума + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)

# От конзолата се четат 3 реда:
# 1. Депозирана сума – реално число;
# 2. Срок на депозита(в месеци) – цяло число;
# 3. Годишен лихвен процент – реално число;

# Да се отпечата на конзолата сумата в края на срока.

# Вход:        Изход:
# 200           202.85
# 3
# 5.7

# Обяснения:
# 1. изчисляваме натрупаната лихва: 200 * 5.7% = 11.4лв.
# 2. изчисляваме лихвата за 1 месец: 11.4лв./12 месеца = 0.95лв
# 3. общата сума е 200лв депозит + (3 (срок на депозита) * 0.95 лв)

deposited_sum = float(input())
deposit_deadline = int(input())
annual_interest_percentage = float(input())

sum = deposited_sum + deposit_deadline * ((deposited_sum * (annual_interest_percentage/100)) / 12)

print(sum)
