# За лятната ваканция в спикъка със задължителна литература на Жоро има определен брой книги, но Жоро
# предпочита да играе с приятели навън. Вашата задача е да помогнете на Жоро да изчисли колко часа на ден
# трябва да отделя, за да прочете необходимата литература, но и да прекарва максимално време навън.
# Вход
# От конзолата се четат 3 реда:
# 1. Брой страници в текущата книга – цяло число;
# 2. Страници, които може да прочита за 1 час – цяло число;
# 3. Броя на дните, за които трябва да прочете книгата – цяло число;
# Изход
# Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.

# Вход: 212, 20, 2
# Изход: 5.3

book_pages = int(input())
pages_per_hour = int(input())
days_per_book = int(input())

total_hours = book_pages / (pages_per_hour * days_per_book)

print(total_hours)
