# Мария решава да мине на диета и отива до близкия пазар, за да купи ягоди, банани, портокали и малини. Да
# се напише програма, която пресмята колко пари са ѝ необходими за да плати сметката, като знаете, че:
#  цената на малините е на половина по-ниска от тази на ягодите;
#  цената на портокалите е с 40% по-ниска от цената на малините;
#  цената на бананите е с 80% по-ниска от цената на малините.
# Вход
# От конзолата се четат 5 реда:
# 1. Цена на ягодите в лева – реално число;
# 2. Количество на бананите в килограми – реално число;
# 3. Количество на портокалите в килограми – реално число;
# 4. Количество на малините в килограми – реално число;
# 5. Количество на ягодите в килограми – реално число.
# Изход
# Да се отпечата на конзолата едно число:
#  парите, които са необходими на Мария.
# Примерен вход и изход
# Вход: Изход
# 57.5
# 10
# 3.4
# 6.5
# 1.7
#
# Изход:
# 400.775

# Обяснения:
# Цена на малините за килограм: 28.75 лв.
#
# Цена на портокалите за килограм: 28.75 – (0.4 * 28.75) = 17.25лв.
# Цена на бананите за килограм: 28.75 – (0.8 * 28.75) = 5.75 лв.
# Сума за малините: 6.5 * 28.75 = 186.875 лв.
# Сума за портокалите: 3.4 * 17.25 = 58.65 лв.
# Сума за бананите: 10 * 5.75 = 57.5 лв.
# Сума за ягодите: 1.7 * 57.5 = 97.75 лв.
# Обща сума: 186.875 + 58.65 + 57.5 + 97.75 = 400.775 лв.

pr_strawberries = float(input())
kg_bannanas = float(input())
kg_oranges = float(input())
kg_raspberries = float(input())
kg_strawberries = float(input())

pr_raspberries = 0.5 * pr_strawberries
pr_oranges = 0.6 * pr_raspberries
pr_bananas = 0.2 * pr_raspberries

total_raspberries = pr_raspberries * kg_raspberries
total_bannanas = pr_bananas * kg_bannanas
total_oranges = pr_oranges * kg_oranges
total_strawberries = pr_strawberries * kg_strawberries

total_money = total_bannanas + total_oranges + total_raspberries + total_strawberries
print(total_money)

