# За рождения си ден Любомир получил аквариум с формата на паралелепипед. Трябва да се пресметне колко
# литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му е заета от пясък,
# растения, нагревател и помпа. Размерите му – дължина, широчина и височина в сантиметри ще бъдат
# въведени от конзолата.
# Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм 3 /.
# Да се напише програма, която изчислява литрите вода, която са необходими за напълването на аквариума.
# Вход
# От конзолата се четат 4 реда:
# 1. Дължина в см – цяло число
# 2. Широчина в см – цяло число
# 3. Височина в см – цяло число
# 4. Процент зает обем – реално число
# Изход
# Да се отпечата на конзолата едно число:
#  литрите вода, които ще събира аквариума.
# Примерен вход и изход
# Вход:
# 85
# 75
# 47
# 17
# Изход:
# 248.68875
# Обяснения:
# Изчисляваме обем на аквариум:
# обем на аквариум= 85*75*47=299625 см 3
# общо литри, които ще събере: 299625 * 0.001=299.625 литра
# процент: 17*0.01=0.17
# литрите, които ще трябват : 299.625*(1-0.17) = 248.68875 литра


length_cm = float(input())
width_cm = float(input())
height_cm = float(input())
percentage_occupied_volume = float(input())

aquarium_volume = length_cm * width_cm * height_cm
liters_volume = aquarium_volume * 0.001
percentage = 0.01 * percentage_occupied_volume
liters_required = (1 - percentage) * liters_volume

print (liters_required)
